Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_reg.h
/**
 * \file IfxCif_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:14:11 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Cif_Registers_Cfg Cif address
 * \ingroup IfxLld_Cif_Registers
 * 
 * \defgroup IfxLld_Cif_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Cif_Registers_Cfg
 *
 * \defgroup IfxLld_Cif_Registers_Cfg_Cif 2-CIF
 * \ingroup IfxLld_Cif_Registers_Cfg
 *
 *
 */
#ifndef IFXCIF_REG_H
#define IFXCIF_REG_H 1
/******************************************************************************/
#include "IfxCif_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Cif_Cfg_BaseAddress
 * \{  */

/** \brief CIF object */
#define MODULE_CIF /*lint --e(923)*/ ((*(Ifx_CIF*)0xFA001F00u))
/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cif_Cfg_Cif
 * \{  */
/** \brief 0, Clock Control Register */
#define CIF_BBB_CLC /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_CLC*)0xFA001F00u)

/** \brief 4, Module Identification Register */
#define CIF_BBB_MODID /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_MODID*)0xFA001F04u)

/** \brief 8, General Purpose Control Register */
#define CIF_BBB_GPCTL /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_GPCTL*)0xFA001F08u)

/** \brief C, Access Enable Register 0 */
#define CIF_BBB_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_ACCEN0*)0xFA001F0Cu)

/** \brief 10, Access Enable Register 1 */
#define CIF_BBB_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_ACCEN1*)0xFA001F10u)

/** \brief 14, Kernel Reset Register 0 */
#define CIF_BBB_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRST0*)0xFA001F14u)

/** \brief 18, Kernel Reset Register 1 */
#define CIF_BBB_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRST1*)0xFA001F18u)

/** \brief 1C, Kernel Reset Status Clear Register */
#define CIF_BBB_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CIF_BBB_KRSTCLR*)0xFA001F1Cu)

/** \brief 0, Clock Control Register */
#define CIF_CCL /*lint --e(923)*/ (*(volatile Ifx_CIF_CCL*)0xFA002000u)

/** \brief 8, CIF Revision Identification Register */
#define CIF_ID /*lint --e(923)*/ (*(volatile Ifx_CIF_ID*)0xFA002008u)

/** \brief 10, CIF Internal Clock Control Register */
#define CIF_ICCL /*lint --e(923)*/ (*(volatile Ifx_CIF_ICCL*)0xFA002010u)

/** \brief 14, CIF Internal Reset Control Register */
#define CIF_IRCL /*lint --e(923)*/ (*(volatile Ifx_CIF_IRCL*)0xFA002014u)

/** \brief 18, CIF Data Path Control Register */
#define CIF_DPCL /*lint --e(923)*/ (*(volatile Ifx_CIF_DPCL*)0xFA002018u)

/** \brief 0, ISP Global Control Register */
#define CIF_ISP_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_CTRL*)0xFA002400u)

/** \brief 4, ISP Acquisition Properties Register */
#define CIF_ISP_ACQ_PROP /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_PROP*)0xFA002404u)

/** \brief 8, ISP Acquisition Horizontal Offset Register */
#define CIF_ISP_ACQ_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_OFFS*)0xFA002408u)

/** \brief C, ISP Acquistion Vertical Offset Register */
#define CIF_ISP_ACQ_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_OFFS*)0xFA00240Cu)

/** \brief 10, ISP Acquisition Horizontal Size Register */
#define CIF_ISP_ACQ_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_H_SIZE*)0xFA002410u)

/** \brief 14, ISP Acquisition Vertical Size Register */
#define CIF_ISP_ACQ_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_V_SIZE*)0xFA002414u)

/** \brief 18, ISP Acquisition Number of Frames Register */
#define CIF_ISP_ACQ_NR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ACQ_NR_FRAMES*)0xFA002418u)

/** \brief 194, ISP Output Window Horizontal Offset Register */
#define CIF_ISP_OUT_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS*)0xFA002594u)

/** \brief 198, ISP Output Window Vertical Offset Register */
#define CIF_ISP_OUT_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS*)0xFA002598u)

/** \brief 19C, ISP Output Horizontal Picture Size Register */
#define CIF_ISP_OUT_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE*)0xFA00259Cu)

/** \brief 1A0, ISP Output Vertical Picture Size Register */
#define CIF_ISP_OUT_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE*)0xFA0025A0u)

/** \brief 1A8, ISP Shadow Flags Register */
#define CIF_ISP_FLAGS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_FLAGS_SHD*)0xFA0025A8u)

/** \brief 1AC, ISP Output Window Horizontal Offset Shadow Register */
#define CIF_ISP_OUT_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_OFFS_SHD*)0xFA0025ACu)

/** \brief 1B0, ISP Output Window Vertical Offset Shadow Register */
#define CIF_ISP_OUT_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_OFFS_SHD*)0xFA0025B0u)

/** \brief 1B4, ISP Output Horizontal Picture Size Shadow Register */
#define CIF_ISP_OUT_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_H_SIZE_SHD*)0xFA0025B4u)

/** \brief 1B8, ISP Output Vertical Picture Size Shadow Register */
#define CIF_ISP_OUT_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_OUT_V_SIZE_SHD*)0xFA0025B8u)

/** \brief 1BC, ISP Interrupt Mask Register */
#define CIF_ISP_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_IMSC*)0xFA0025BCu)

/** \brief 1C0, ISP Raw Interrupt Status Register */
#define CIF_ISP_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_RIS*)0xFA0025C0u)

/** \brief 1C4, ISP Masked Interrupt Status Register */
#define CIF_ISP_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_MIS*)0xFA0025C4u)

/** \brief 1C8, ISP Interrupt Clear Register */
#define CIF_ISP_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ICR*)0xFA0025C8u)

/** \brief 1CC, ISP Interrupt Set Register */
#define CIF_ISP_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ISR*)0xFA0025CCu)

/** \brief 23C, ISP Error Register */
#define CIF_ISP_ERR /*lint --e(923)*/ (*(volatile Ifx_CIF_ISP_ERR*)0xFA00263Cu)

