Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_reg.h
/** \brief 14, ISP Image Stabilization Output Vertical Picture Size Register */
#define CIF_ISPIS_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE*)0xFA004314u)

/** \brief 18, ISP Image Stabilization Maximum Horizontal Displacement Register */
#define CIF_ISPIS_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DX*)0xFA004318u)

/** \brief 1C, ISP Image Stabilization Maximum Vertical Displacement Register */
#define CIF_ISPIS_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_MAX_DY*)0xFA00431Cu)

/** \brief 20, ISP Image Stabilization Camera Displacement Register */
#define CIF_ISPIS_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_DISPLACE*)0xFA004320u)

/** \brief 24, ISP Image Current Horizontal Offset Of Output Window Shadow Register */
#define CIF_ISPIS_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_OFFS_SHD*)0xFA004324u)

/** \brief 28, ISP Image Current Vertical Offset Of Output Window Shadow Register */
#define CIF_ISPIS_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_OFFS_SHD*)0xFA004328u)

/** \brief 2C, ISP Image Current Output Horizontal Picture Size Shadow Register */
#define CIF_ISPIS_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_H_SIZE_SHD*)0xFA00432Cu)

/** \brief 30, ISP Image Current Output Vertical Picture Size Shadow Register */
#define CIF_ISPIS_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_ISPIS_V_SIZE_SHD*)0xFA004330u)

/** \brief 0, Watchdog Control Register */
#define CIF_WD_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_CTRL*)0xFA004400u)

/** \brief 4, Watchdog Vertical Timeout Register */
#define CIF_WD_V_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_V_TIMEOUT*)0xFA004404u)

/** \brief 8, Watchdog Horizontal Timeout Register */
#define CIF_WD_H_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_H_TIMEOUT*)0xFA004408u)

/** \brief C, Watchdog Interrupt Mask Register */
#define CIF_WD_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_IMSC*)0xFA00440Cu)

/** \brief 10, Watchdog Raw Interrupt Status Register */
#define CIF_WD_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_RIS*)0xFA004410u)

/** \brief 14, Watchdog Masked Interrupt Status Register */
#define CIF_WD_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_MIS*)0xFA004414u)

/** \brief 18, Watchdog Interrupt Clear Register */
#define CIF_WD_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ICR*)0xFA004418u)

/** \brief 1C, Watchdog Interrupt Set Register */
#define CIF_WD_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ISR*)0xFA00441Cu)

/** \brief 0, Linear Downscaler Control Register */
#define CIF_LDS_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_CTRL*)0xFA004500u)

/** \brief 4, Linear Downscaler Factor Register */
#define CIF_LDS_FAC /*lint --e(923)*/ (*(volatile Ifx_CIF_LDS_FAC*)0xFA004504u)

/** \brief 0, Debug Path Control Register */
#define CIF_DP_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_CTRL*)0xFA004700u)

/** \brief 4, Debug Path Predivider Control Register */
#define CIF_DP_PDIV_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_PDIV_CTRL*)0xFA004704u)

/** \brief 8, Debug Path Frame/Line Counter Status Register */
#define CIF_DP_FLC_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_FLC_STAT*)0xFA004708u)

/** \brief C, Debug Path Predivider Counter Status Register */
#define CIF_DP_PDIV_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_PDIV_STAT*)0xFA00470Cu)

/** \brief 10, Debug Path Timestamp Counter Status Register */
#define CIF_DP_TSC_STAT /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_TSC_STAT*)0xFA004710u)

/** \brief 14, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S0 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004714u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S0.
* To use register names with standard convension, please use CIF_DP_UDS_1S0.
*/
#define CIF_DP_UDS_0 (CIF_DP_UDS_1S0)

/** \brief 18, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S1 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004718u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S1.
* To use register names with standard convension, please use CIF_DP_UDS_1S1.
*/
#define CIF_DP_UDS_1 (CIF_DP_UDS_1S1)

/** \brief 1C, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S2 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA00471Cu)
/** Alias (User Manual Name) for CIF_DP_UDS_1S2.
* To use register names with standard convension, please use CIF_DP_UDS_1S2.
*/
#define CIF_DP_UDS_2 (CIF_DP_UDS_1S2)

/** \brief 20, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S3 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004720u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S3.
* To use register names with standard convension, please use CIF_DP_UDS_1S3.
*/
#define CIF_DP_UDS_3 (CIF_DP_UDS_1S3)

/** \brief 24, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S4 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004724u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S4.
* To use register names with standard convension, please use CIF_DP_UDS_1S4.
*/
#define CIF_DP_UDS_4 (CIF_DP_UDS_1S4)

/** \brief 28, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S5 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004728u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S5.
* To use register names with standard convension, please use CIF_DP_UDS_1S5.
*/
#define CIF_DP_UDS_5 (CIF_DP_UDS_1S5)

/** \brief 2C, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S6 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA00472Cu)
/** Alias (User Manual Name) for CIF_DP_UDS_1S6.
* To use register names with standard convension, please use CIF_DP_UDS_1S6.
*/
#define CIF_DP_UDS_6 (CIF_DP_UDS_1S6)

/** \brief 30, Debug Path User Defined Symbol ${x} Register */
#define CIF_DP_UDS_1S7 /*lint --e(923)*/ (*(volatile Ifx_CIF_DP_UDS_1S*)0xFA004730u)
/** Alias (User Manual Name) for CIF_DP_UDS_1S7.
* To use register names with standard convension, please use CIF_DP_UDS_1S7.
*/
#define CIF_DP_UDS_7 (CIF_DP_UDS_1S7)

