Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_reg.h
/** \brief 230, Extra Path ${i} Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_IC_1S2_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE_SHD*)0xFA004B30u)
/** Alias (User Manual Name) for CIF_EP_IC_1S2_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S2_V_SIZE_SHD.
*/
#define CIF_EP_2_IC_V_SIZE_SHD (CIF_EP_IC_1S2_V_SIZE_SHD)

/** \brief 300, Extra Path ${i} Image Cropping Control Register */
#define CIF_EP_IC_1S3_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_CTRL*)0xFA004C00u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S3_CTRL.
*/
#define CIF_EP_3_IC_CTRL (CIF_EP_IC_1S3_CTRL)

/** \brief 304, Extra Path ${i} Image Cropping Recenter Register */
#define CIF_EP_IC_1S3_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_RECENTER*)0xFA004C04u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S3_RECENTER.
*/
#define CIF_EP_3_IC_RECENTER (CIF_EP_IC_1S3_RECENTER)

/** \brief 308, Extra Path ${i} Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_IC_1S3_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS*)0xFA004C08u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_OFFS.
*/
#define CIF_EP_3_IC_H_OFFS (CIF_EP_IC_1S3_H_OFFS)

/** \brief 30C, Extra Path ${i} Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_IC_1S3_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS*)0xFA004C0Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_OFFS.
*/
#define CIF_EP_3_IC_V_OFFS (CIF_EP_IC_1S3_V_OFFS)

/** \brief 310, Extra Path ${i} Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_IC_1S3_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE*)0xFA004C10u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_SIZE.
*/
#define CIF_EP_3_IC_H_SIZE (CIF_EP_IC_1S3_H_SIZE)

/** \brief 314, Extra Path ${i} Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_IC_1S3_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE*)0xFA004C14u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_SIZE.
*/
#define CIF_EP_3_IC_V_SIZE (CIF_EP_IC_1S3_V_SIZE)

/** \brief 318, Extra Path ${i} Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S3_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004C18u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DX.
*/
#define CIF_EP_3_IC_MAX_DX (CIF_EP_IC_1S3_MAX_DX)

/** \brief 31C, Extra Path ${i} Image Cropping Maximum Vertical Displacement Register */
#define CIF_EP_IC_1S3_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DY*)0xFA004C1Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S3_MAX_DY.
*/
#define CIF_EP_3_IC_MAX_DY (CIF_EP_IC_1S3_MAX_DY)

/** \brief 320, Extra Path ${i} Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S3_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_DISPLACE*)0xFA004C20u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S3_DISPLACE.
*/
#define CIF_EP_3_IC_DISPLACE (CIF_EP_IC_1S3_DISPLACE)

/** \brief 324, Extra Path ${i} Image Cropping Current Horizontal Offset of Output Window Shadow Register */
#define CIF_EP_IC_1S3_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS_SHD*)0xFA004C24u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_OFFS_SHD.
*/
#define CIF_EP_3_IC_H_OFFS_SHD (CIF_EP_IC_1S3_H_OFFS_SHD)

/** \brief 328, Extra Path ${i} Image Cropping Current Vertical Offset Of Output Window Shadow Register */
#define CIF_EP_IC_1S3_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS_SHD*)0xFA004C28u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_OFFS_SHD.
*/
#define CIF_EP_3_IC_V_OFFS_SHD (CIF_EP_IC_1S3_V_OFFS_SHD)

/** \brief 32C, Extra Path ${i} Image Cropping Current Output Horizontal Picture Size Shadow Register */
#define CIF_EP_IC_1S3_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE_SHD*)0xFA004C2Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_H_SIZE_SHD.
*/
#define CIF_EP_3_IC_H_SIZE_SHD (CIF_EP_IC_1S3_H_SIZE_SHD)

/** \brief 330, Extra Path ${i} Image Cropping Current Output Vertical Picture Size Shadow Register */
#define CIF_EP_IC_1S3_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE_SHD*)0xFA004C30u)
/** Alias (User Manual Name) for CIF_EP_IC_1S3_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S3_V_SIZE_SHD.
*/
#define CIF_EP_3_IC_V_SIZE_SHD (CIF_EP_IC_1S3_V_SIZE_SHD)

/** \brief 400, Extra Path ${i} Image Cropping Control Register */
#define CIF_EP_IC_1S4_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_CTRL*)0xFA004D00u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S4_CTRL.
*/
#define CIF_EP_4_IC_CTRL (CIF_EP_IC_1S4_CTRL)

/** \brief 404, Extra Path ${i} Image Cropping Recenter Register */
#define CIF_EP_IC_1S4_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_RECENTER*)0xFA004D04u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S4_RECENTER.
*/
#define CIF_EP_4_IC_RECENTER (CIF_EP_IC_1S4_RECENTER)

/** \brief 408, Extra Path ${i} Image Cropping Horizontal Offset of Output Window Register */
#define CIF_EP_IC_1S4_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_OFFS*)0xFA004D08u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_OFFS.
*/
#define CIF_EP_4_IC_H_OFFS (CIF_EP_IC_1S4_H_OFFS)

/** \brief 40C, Extra Path ${i} Image Cropping Vertical Offset Of Output Window Register */
#define CIF_EP_IC_1S4_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_OFFS*)0xFA004D0Cu)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_OFFS.
*/
#define CIF_EP_4_IC_V_OFFS (CIF_EP_IC_1S4_V_OFFS)

/** \brief 410, Extra Path ${i} Image Cropping Output Horizontal Picture Size Register */
#define CIF_EP_IC_1S4_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_H_SIZE*)0xFA004D10u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S4_H_SIZE.
*/
#define CIF_EP_4_IC_H_SIZE (CIF_EP_IC_1S4_H_SIZE)

/** \brief 414, Extra Path ${i} Image Cropping Output Vertical Picture Size Register */
#define CIF_EP_IC_1S4_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_V_SIZE*)0xFA004D14u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S4_V_SIZE.
*/
#define CIF_EP_4_IC_V_SIZE (CIF_EP_IC_1S4_V_SIZE)

/** \brief 418, Extra Path ${i} Image Cropping Maximum Horizontal Displacement Register */
#define CIF_EP_IC_1S4_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_1S_MAX_DX*)0xFA004D18u)
/** Alias (User Manual Name) for CIF_EP_IC_1S4_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S4_MAX_DX.
*/
#define CIF_EP_4_IC_MAX_DX (CIF_EP_IC_1S4_MAX_DX)

