Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_reg.h
/** \brief 204, Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S1_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005604u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_INIT.
*/
#define CIF_MIEP_1_INIT (CIF_MIEP_CH_1S1_INIT)

/** \brief 208, Memory Interface Base Address for Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S1_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005608u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_BASE_AD_INIT.
*/
#define CIF_MIEP_1_BASE_AD_INIT (CIF_MIEP_CH_1S1_BASE_AD_INIT)

/** \brief 20C, Memory Interface Size of Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S1_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00560Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_SIZE_INIT.
*/
#define CIF_MIEP_1_SIZE_INIT (CIF_MIEP_CH_1S1_SIZE_INIT)

/** \brief 210, Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005610u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_INIT.
*/
#define CIF_MIEP_1_OFFS_CNT_INIT (CIF_MIEP_CH_1S1_OFFS_CNT_INIT)

/** \brief 214, Memory Interface Offset Counter Start Value for Extra Path ${j} Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005614u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_START.
*/
#define CIF_MIEP_1_OFFS_CNT_START (CIF_MIEP_CH_1S1_OFFS_CNT_START)

/** \brief 218, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S1_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005618u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_1_IRQ_OFFS_INIT (CIF_MIEP_CH_1S1_IRQ_OFFS_INIT)

/** \brief 21C, Memory Interface Extra Path ${j} Control Internal Shadow Register */
#define CIF_MIEP_CH_1S1_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00561Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_CTRL_SHD.
*/
#define CIF_MIEP_1_CTRL_SHD (CIF_MIEP_CH_1S1_CTRL_SHD)

/** \brief 220, Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S1_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005620u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_BASE_AD_SHD.
*/
#define CIF_MIEP_1_BASE_AD_SHD (CIF_MIEP_CH_1S1_BASE_AD_SHD)

/** \brief 224, Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S1_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005624u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_SIZE_SHD.
*/
#define CIF_MIEP_1_SIZE_SHD (CIF_MIEP_CH_1S1_SIZE_SHD)

/** \brief 228, Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S1_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005628u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_OFFS_CNT_SHD.
*/
#define CIF_MIEP_1_OFFS_CNT_SHD (CIF_MIEP_CH_1S1_OFFS_CNT_SHD)

/** \brief 22C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register */
#define CIF_MIEP_CH_1S1_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD*)0xFA00562Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S1_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S1_IRQ_OFFS_SHD.
*/
#define CIF_MIEP_1_IRQ_OFFS_SHD (CIF_MIEP_CH_1S1_IRQ_OFFS_SHD)

/** \brief 300, Memory Interface Extra Path ${j} Control Register */
#define CIF_MIEP_CH_1S2_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005700u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_CTRL.
*/
#define CIF_MIEP_2_CTRL (CIF_MIEP_CH_1S2_CTRL)

/** \brief 304, Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S2_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005704u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_INIT.
*/
#define CIF_MIEP_2_INIT (CIF_MIEP_CH_1S2_INIT)

/** \brief 308, Memory Interface Base Address for Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S2_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005708u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_BASE_AD_INIT.
*/
#define CIF_MIEP_2_BASE_AD_INIT (CIF_MIEP_CH_1S2_BASE_AD_INIT)

/** \brief 30C, Memory Interface Size of Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S2_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00570Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_SIZE_INIT.
*/
#define CIF_MIEP_2_SIZE_INIT (CIF_MIEP_CH_1S2_SIZE_INIT)

/** \brief 310, Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005710u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_INIT.
*/
#define CIF_MIEP_2_OFFS_CNT_INIT (CIF_MIEP_CH_1S2_OFFS_CNT_INIT)

/** \brief 314, Memory Interface Offset Counter Start Value for Extra Path ${j} Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005714u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_START.
*/
#define CIF_MIEP_2_OFFS_CNT_START (CIF_MIEP_CH_1S2_OFFS_CNT_START)

/** \brief 318, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S2_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005718u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_2_IRQ_OFFS_INIT (CIF_MIEP_CH_1S2_IRQ_OFFS_INIT)

