Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_reg.h
/** \brief 31C, Memory Interface Extra Path ${j} Control Internal Shadow Register */
#define CIF_MIEP_CH_1S2_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00571Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_CTRL_SHD.
*/
#define CIF_MIEP_2_CTRL_SHD (CIF_MIEP_CH_1S2_CTRL_SHD)

/** \brief 320, Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S2_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005720u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_BASE_AD_SHD.
*/
#define CIF_MIEP_2_BASE_AD_SHD (CIF_MIEP_CH_1S2_BASE_AD_SHD)

/** \brief 324, Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S2_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005724u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_SIZE_SHD.
*/
#define CIF_MIEP_2_SIZE_SHD (CIF_MIEP_CH_1S2_SIZE_SHD)

/** \brief 328, Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S2_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005728u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_OFFS_CNT_SHD.
*/
#define CIF_MIEP_2_OFFS_CNT_SHD (CIF_MIEP_CH_1S2_OFFS_CNT_SHD)

/** \brief 32C, Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register */
#define CIF_MIEP_CH_1S2_IRQ_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD*)0xFA00572Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S2_IRQ_OFFS_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S2_IRQ_OFFS_SHD.
*/
#define CIF_MIEP_2_IRQ_OFFS_SHD (CIF_MIEP_CH_1S2_IRQ_OFFS_SHD)

/** \brief 400, Memory Interface Extra Path ${j} Control Register */
#define CIF_MIEP_CH_1S3_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL*)0xFA005800u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL.
*/
#define CIF_MIEP_3_CTRL (CIF_MIEP_CH_1S3_CTRL)

/** \brief 404, Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register */
#define CIF_MIEP_CH_1S3_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_INIT*)0xFA005804u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_INIT.
*/
#define CIF_MIEP_3_INIT (CIF_MIEP_CH_1S3_INIT)

/** \brief 408, Memory Interface Base Address for Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S3_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT*)0xFA005808u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_INIT.
*/
#define CIF_MIEP_3_BASE_AD_INIT (CIF_MIEP_CH_1S3_BASE_AD_INIT)

/** \brief 40C, Memory Interface Size of Extra Path ${j} Data Buffer Register */
#define CIF_MIEP_CH_1S3_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_INIT*)0xFA00580Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_INIT.
*/
#define CIF_MIEP_3_SIZE_INIT (CIF_MIEP_CH_1S3_SIZE_INIT)

/** \brief 410, Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT*)0xFA005810u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_INIT.
*/
#define CIF_MIEP_3_OFFS_CNT_INIT (CIF_MIEP_CH_1S3_OFFS_CNT_INIT)

/** \brief 414, Memory Interface Offset Counter Start Value for Extra Path ${j} Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START*)0xFA005814u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_START.
*/
#define CIF_MIEP_3_OFFS_CNT_START (CIF_MIEP_CH_1S3_OFFS_CNT_START)

/** \brief 418, Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
#define CIF_MIEP_CH_1S3_IRQ_OFFS_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT*)0xFA005818u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_IRQ_OFFS_INIT.
*/
#define CIF_MIEP_3_IRQ_OFFS_INIT (CIF_MIEP_CH_1S3_IRQ_OFFS_INIT)

/** \brief 41C, Memory Interface Extra Path ${j} Control Internal Shadow Register */
#define CIF_MIEP_CH_1S3_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_CTRL_SHD*)0xFA00581Cu)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_CTRL_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_CTRL_SHD.
*/
#define CIF_MIEP_3_CTRL_SHD (CIF_MIEP_CH_1S3_CTRL_SHD)

/** \brief 420, Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S3_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD*)0xFA005820u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_BASE_AD_SHD.
*/
#define CIF_MIEP_3_BASE_AD_SHD (CIF_MIEP_CH_1S3_BASE_AD_SHD)

/** \brief 424, Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S3_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_SIZE_SHD*)0xFA005824u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_SIZE_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_SIZE_SHD.
*/
#define CIF_MIEP_3_SIZE_SHD (CIF_MIEP_CH_1S3_SIZE_SHD)

/** \brief 428, Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register */
#define CIF_MIEP_CH_1S3_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD*)0xFA005828u)
/** Alias (User Manual Name) for CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MIEP_CH_1S3_OFFS_CNT_SHD.
*/
#define CIF_MIEP_3_OFFS_CNT_SHD (CIF_MIEP_CH_1S3_OFFS_CNT_SHD)

